{
    "latest_news_section": [
        {
            "title": "USA Cricket sacks head coach Stuart Law following allegations",
            "news": " Cricbuzz has learnt that USA head coach Stuart Law has been sacked with immediate effect after the team's humiliating 10-wicket defeat against Scotland on Friday. Law's ouster in the middle of the series and within 7 months of his appointment has sent shockwaves in the American cricket circles. It is understood that the decision to show Law the pink slip comes on the back of some serious allegations of discrimination, mistrust and favouritism laid by captain Monank Patel and 7-8 senior players in the squad. \n Tensions soared between the coach and the concerned players during the Netherlands tour, USA's first assignment after their historic world cup run. It is understood that USA Cricket tried to de-escalate the situation to begin with but eventually instituted an official investigation into Law's alleged misconduct during the recent Namibia tour. \n Law, 56, has been omnipresent as a coach on the international circuit after his retirement as a player in 2009. Before being at the helm at USA, Law has served as a coach in various capacities with Sri Lanka, West Indies and Bangladesh. He took over the vacant USA head coach position in the lead up to the T20 World Cup earlier this year. He kicked off his assignment on an auspicious note with a 4-0 series win against Canada. He oversaw USA's shock series win against Bangladesh and their dream run in the T20 World Cup which saw USA advance to super 8s after a historic win against Pakistan. USA have been a mixed bag post the world cup but more recently tailing off after the T20I series whitewash against Nepal before the ignominy of the 10-wicket loss on Friday. \n Vincent Vinay Kumar, the assistant coach will assume the duties as the interim head coach and Usman Rafiq, former USA off spinner, has been added as the assistant coach for the remaining 3 ODIs against Nepal and Scotland. "
        },
        {
            "title": "Need to find ways of scoring runs to put bowlers under pressure: Rohit Sharma",
            "news": " Rohit Sharma admitted that his side didn't bat well in the first innings of the Pune Test and that a deficit of over 100 on a tricky surface ultimately proved to be too huge to surmount a turnaround. India slipped to their first Test series loss at home in 12 years on Saturday (October 26) with another failure in this game fuelling talks of a decline in batting standards against spin. \n While the Indian captain steered clear of indulging in hyperboles or finger-pointing, he did admit that there was a need to consider varied means of countering spin - something the visiting batters managed to do so. \"We didn't bat well in the first innings. We got only 150 [156] and the batters do understand that they failed to respond to that pressure, that challenge of playing on whatever pitch,\" Rohit said after the 113-run loss in Pune. \n \"The pitch was not bad at all. We just didn't play well enough to get closer to that first inning score of theirs. And then obviously with 100 [103] runs behind, we always knew that it is going to be challenging whatever score we have to get. Because as the game went on, the pitch started behaving slightly differently. \n \"And then, yeah, 350 to get, we knew that the mindset that we had was wanting to get those runs. We had a great partnership with [Yashasvi] Jaiswal and [Shubman] Gill in the middle. But again, then we lost wickets, quickly after that. And then obviously we knew that the game was slipping out of our hands. And we failed to respond to that pressure.\" \n Elaborating on redirecting the pressure applied by Mitchell Santner & Co., Rohit admitted that the batters needed to find different scoring options - both in front and behind square - in order to manipulate the field and ease the stranglehold the opposition spinners can create. This topic came into prominence earlier this year after Ollie Pope swept and reverse-swept England to a famous win in Hyderabad. While India's batters found their own ways to push back the England threat in the remainder of that series, they were unable to do so on a pitch with substantial purchase for spin. \n \"You have to look to get runs also and that's how you try and put the bowlers under pressure,\" Rohit said. \"Like I just mentioned about New Zealand batters, they were trying to do different things and it worked very well for them. Because they were trying to do different things and put bowlers under pressure and in that process, there is a good chance that the bowlers will try and do different things, misread the length, and that works in the opposition's favour and that is exactly what happened. \n \"That's one thing that we wanted to do as a team. Try and play paddle, reverse, sweep. Because when you do those kind of things, they have to take one extra man from the front and put it behind. And that allows you to then play straighter and hit those gaps. And that is what New Zealand did. They exploited that fielders, they played that reverse and sweep and paddle, which meant we had to put the fielders behind square. \n \"And that allowed them to then play with a straighter bat as well. So that is what we have been discussing. We need to try and find ways to score runs. \n \"Because when you are playing on pitches like this, where the odd ball turns, the odd ball comes with the arm, you have to find options to do different things. And then when you play with that field a little bit, it allows you to then play with a straighter bat as well. We have been talking about that for a while, of sweeping and reverse sweeping and stuff like that. \n \"But eventually, when the player goes out in the middle, it is his decision what he thinks at that particular time is right to do against certain bowlers. Certain bowlers, it is not easy to sweep and reverse sweep. Because they get the ball to come in really quick. So yeah, it depends on every batter that is in the middle to take that call. Whether it is doing that or whether it is going down the ground, stepping out and playing with your soft hand, pushing the ball in the gap, all those things. So that is what I think overall, if I look at the last 10-15 Test matches that we played in India, we did that. We were not able to do it in these two games.\" \n The Indian captain also came out in defence of his two ace spinners, Ravichandran Ashwin and Ravindra Jadeja, who were off colour in the Test and outbowled by Santner in particular, who found the right variety in speeds and trajectories for the surface and more importantly kept the stumps in play enough to walk away with a rich match haul of 13 for 158. \"There is too much expectation on those two guys. Every game they play, they are expected to take wickets, they are expected to run through the team and they are expected to win Test matches for us. I don't think that's fair,\" Rohit said. \n \"It's the responsibility of all of us to make sure that we get the Test match wins, not just the two guys. Of course, by their standard, they know where they stand and what they haven't been able to do or what they have done really well. But again, both of them have played so much cricket here and have such huge contributions to our success of having that home streak of 18 series. These two have played a major role in that. So, a couple of series, I am not going to look into too much, especially with those two guys. They know exactly what happens and sometimes they are allowed to have some bad games here and there, and not go by that expectation that this is the opportunity for me to take wickets and run through the opposition. \n \"That's not going to happen every time. So, you got to be ready with the other guys to step in. Like we keep talking about with the batters that it is not the responsibility of a few individuals, it is the collective batting unit who needs to come together. So, it's the same with the bowling unit as well. If Ash doesn't do well, it's Jadeja who needs to come to the party or Washi or Kuldeep or Axar. Those guys. So, it has to be shared amongst everyone. But yeah, look, Washi [Washington Sundar] had a great game. I am really proud of that. He is proud of that and we are happy with his performance. He bowled so well. \n \"And then again, like you said about Santner, he kept the ball on the stumps and that is where the challenge happens. When you pitch it on the stumps, you don't know which one is going away, which one is keeping straight. And that is something that we had to exploit a lot more as a bowling unit to try and make them play as many as possible and pitch it more on the stumps. Those are the things that we will sit and discuss and we will go through it and see where they are at with that. \n \"But again, you are talking about someone who has taken 500 and 300 wickets respectively. So, they know exactly how they have gotten those wickets. And how they have every time come out and won Test matches for us. So, it's a very hard honestly on them to just have that expectation every time that they turn up that they need to take wickets for us. It can happen. It can happen that things won't work out for them,\" Rohit added. \n Amid talks of a seminal, potentially changing of the guard moment in India's Test cricket, Rohit preached the virtue of stability and said he would not overreact to this one series loss. \"We are not able to bat properly. So, it is allowed once in 12 years. If there were such collapses for 12 years, then we would not have been able to win. But, in India, we have a lot of expectations. That we have to win all the matches. We have made it a habit. Not that it is your fault. Because we have played such good cricket. So, the expectations have gone above a level where the expectations are that India cannot do anything wrong in India. This does not happen. \n \"Because the opposition is also playing cricket. The opposition has been watching India for so many years. What is India doing? Why does India win so many matches? So, they also come prepared. So, sometimes there is a very small margin where an outside team is coming. They are playing a little better than us and winning. That's it. I cannot see much in that. Because, as I said, we have played very challenging cricket in the last four years. If you see, we won the last series against Bangladesh. And before that, we won against England. 4-1. If you remember the scenarios, you will know how we won those Test matches. \n \"We are sad. It is important to be sad. But, it does not mean that you have to change your entire system. Our system is that we are playing cricket in one way. We just need to change our style a little. That's it.\" "
        },
        {
            "title": "'We wanted to fire a shot first up and I certainly think we've done that in both games'",
            "news": " Adam Gilchrist and Alastair Cook have company in the form of Tom Latham in the rather exclusive list of captains to have won a Test series in India in the 21st century. Conquering a nearly invincible side at home will have a rightful place in the sport's history. And rightly so, the captain of New Zealand was a proud man at the end of the third day in Pune. \n \"I'm still at a loss for words a little bit. It's obviously an immensely proud moment for this group,\" said a beaming Latham. \"Coming off the back of a Sri Lankan series where we didn't get the results that we wanted to come here and play the style of cricket that we've played... We're obviously immensely proud to be in the position of winning two Test matches here. A lot of New Zealand teams have come here over the past 69 years, I think it is, and 13 series. To be the first team to win a series over here is immensely special and very proud of this group,\" said Latham. \n It was important that New Zealand stuck to their guns even after the defeat in Sri Lanka, felt Latham. He was keen on firing the opening salvo as he admitted. \"We've come here and we've wanted to compete and we've wanted to fire a shot first up and I certainly think we've done that in both games, obviously with the ball in the first game but also with the bat here, being able to put first innings runs on the board has been really important and obviously the bowlers went to work over the last couple of days which has been very pleasing to see,\"he quipped. \n Mitchell Santner finished with match-figures of 13 for 157 was a constant presence across the two days when New Zealand bowled, and earned a pat on the back from his captain. \n \"He did a fantastic job, I think obviously the wickets that he got but I think it will go unnoticed the amount of overs he bowled back to back. I think Will [O'Rourke] bowled one over with the new ball from that end and Mitch bowled the rest. \n \"Someone like that to come and bowl that amount of overs to keep being a threat for that amount of time... I kept trying to take him off but he kept taking a wicket, so I said you can keep going,\" said the happy captain and added, \"But I can't praise him enough in terms of what he's done this game.\" \n New Zealand ended up outplaying India with the bat as well, paritcularly so in the first innings. \"From our batting point of view that's all we wanted to do was try to put them under pressure I think we saw a slightly different way that we played yesterday just being a little bit more attacking. We tried to counteract any punch that they threw at us whether it was around the wicket or over the wicket or different field changes. \n \"So obviously it's pleasing that we're in that position where they might have found it a little bit hard. We've certainly been on that side of things before when we've come to these parts of the world where anything you do doesn't work and you do feel under pressure so it's obviously a nice position to be in when you put a score or you get a lead of what we did,\" he said and credited the preparation done for the series. \n \"Nothing prepares you like playing hard Test cricket and I think that was a really important thing for us - being in Sri Lanka beforehand just understanding conditions a little bit more. Even though they're different they are similar in terms of playing a lot of spin trying to find ways to be successful in these conditions. So I think that certainly helped. \n \"We try to leave no stone unturned in terms of what we're going to get. We've been to these parts of the world before and guys understand how they want to approach things and the approach may have looked slightly different in terms of trying to be a little bit more attacking and put India under a little bit of pressure. So I think that was very pleasing.\" "
        },
        {
            "title": "CSK look ahead as Dhoni clears the air over IPL participation",
            "news": " MS Dhoni has cleared the air over his participation in the upcoming season of the Indian Premier League (IPL), and a relieved Chennai Super Kings are not wasting any time to confirm that their talisman will indeed be playing in the coming season. \n \"When he is ready, what else (do) we want. We are happy,\" franchise CEO Kasi Viswanathan told Cricbuzz on Saturday. Viswanathan's assertion comes a day after Dhoni said he is looking forward to enjoying his cricket in the few years that are left in his career. \n \"I just want to enjoy whatever last few years of cricket I am able to play,\" Dhoni was quoted as saying to TOI. \"When you play cricket like a professional sport, it becomes difficult to enjoy it just like a game. That's what I want to do. It's not easy. \n \"The emotions keep coming, the commitments are there. I want to enjoy the game for the next few years. I have to keep myself fit for nine months, so that I can play two and a half months of IPL. You need to plan it out, but at the same time chill a bit.\" \n Although Dhoni's decision, rather announcement, was widely on the expected lines, CSK officials had been maintaining that they were waiting for the final confirmation from him. They have been insisting that they expected to hear his decision by October 28. \n With Dhoni's intentions now clear, the franchise will soon make its final retention decisions. Viswanathan confirmed that Dhoni will call N Srinivasan, the franchise owner, in the coming days to finalise the list of players to be retained. Dhoni, of course, will come in the uncapped category, impacting the auction price by a mere INR 4 crore. \n It's a given that Ravindra Jadeja will be the No. 1 retention, followed by Ruturaj Gaikwad. Matheesha Pathirana, essentially a CSK product, is believed to have agreed to be the No. 3 retention, with his manager finalising the deal in Chennai last week. Among Shivam Dube, Devon Conway, and uncapped player Sameer Rizvi, two should be retained. \n The final selections will be confirmed in the upcoming conversation between Srinivasan and Dhoni, who is expected to return to Ranchi from Goa within the next few days. "
        },
        {
            "title": "England weren't able to stand up to Pakistan's challenges: Ben Stokes",
            "news": " England captain Ben Stokes has said his side were not able to respond to the challenges Pakistan threw at them in the last two Tests. After losing the first Test by an innings and 47 runs, Pakistan staged an epic comeback in the three-Test series to beat England 2-1 following their decision to play the last two matches on rank turners. England lost by 152 runs on a recycled pitch for the second Multan Test and lost at Rawalpindi by nine wickets in less than seven sessions. \n \"The last couple of Tests, we have been thrown some challenges and I think it is pretty easy to assess that we were not able to stand up to them,\" he said. \"The great thing about sport is that those challenges will always come along but in the last two games we weren't able to match what Pakistan threw at us... It's incredibly disappointing to lose a Test match.\" \n Two years ago, England returned from Pakistan with a 3-0 win and became the first side to hand Pakistan a series whitewash at home. They started this tour by making 823 for seven on a flat deck in the first Test on their way to an astonishing win. They became the first side to win a Test by an innings despite conceding 500 in the first innings. But, they accumulated a combined score of 814 for 40 wickets in the next two Tests as Sajid Khan and Noman Ali shared 39 scalps between them. \n England had their desired start to the Rawalpindi Test as they won the toss and scored 267 on day one. It seemed enough on a track that turned sharply from the first over. Pakistan were three wickets down by stumps on day one and trailed England by 194 runs. Quick blows from legspinner Rehan Ahmed, playing for the first time since England's tour of India earlier in the year, left Pakistan tottering at 177 for 7 before Lunch on day two, but a resolute 134 from Saud Shakeel and gutsy knocks of 45 and 48* from Noman and Sajid put Pakistan 77 runs ahead of England. \n Sajid's innings was especially crucial as he hit four sixes in his undefeated run-a-ball knock. It deflated England. When England's Ben Duckett hit him for consecutive fours at the start of the England innings as the sun set at the Pindi Cricket Stadium, Sajid's wily change of pace trapped him in front. \n \"Last night, Sajid came out and played - he took some massive risks when we'd taken that wicket of Noman,\" Stokes said about the turning point in the match. \"Sometimes they work, sometimes they don't and fortunately for Pakistan, it paid off with the way he played. Ten or 15 runs on these kind of wickets are always massive and the way he came out and really took on our spinners was a huge moment in the game.\" \n There are calls for England to drop opener Zak Crawley and vice-captain Ollie Pope following a string of low scores. But, Stokes backed them saying \"there is no doubt in my mind that we have the best top six batters in England\". \n \"You can't shut the door on everything,\" he said. \"Then you are being single-minded to what you want to do. But back to what I said before, there is no doubt in my mind that we have the best top six batters in England.\" \n England's next Test assignment is three Tests in New Zealand. \n \"We've got a very quick turnaround (two weeks) to another challenge in New Zealand so we've got to put the disappointment of the last two games behind us and move on.\" "
        },
        {
            "title": "Pakistan name Rizwan as white-ball captain, pick six uncapped players for AUS, ZIM tours",
            "news": " Pakistan have named Mohammad Rizwan as the permanent white-ball captain, succeeding Babar Azam who recently relinquished his post. For the tours of Australia and Zimbabwe, which will be Rizwan's first two assigments at the helm, Pakistan have picked six uncapped players - six uncapped players - Aamir Jamal, Arafat Minhas, Faisal Akram, Haseebullah, Muhammad Irfan Khan, and Saim Ayub. Pakistan will play three ODIs and three T20Is in Australia and then repeat it in Zimbabwe. \n The Pakistan selectors have also included the uncapped duo of Jahandad Khan and Agha Salman in the T20I squads. The tour of Australia, which begins on November 4, will be followed by the tour of Zimbabwe for a similar six-match white-ball rubber, starting November 24. Mohammad Rizwan, who has been picked for the Australia tour as well as the Zimbabwe ODIs has been rested from the T20I series. Azam is part of both squads for the Australia series but will not go for the Zimbabwe one. \n Pacer Mohammad Hasnain, who had last featured in a ODI in January 2023, has also been recalled to the side at the back of his 17-wicket campaign in the Champions One-Day Cup in Faisalabad last month. He is part of the 50-over squad for the Australia tour and part of both white-ball squads in Zimbabwe. \n Apart from Babar, Naseem Shah, Agha Salman, and Shaheen Afridi, only Arafat Minhas, Haris Rauf, Haseebullah and Muhammad Irfan Khan have been included in both the ODI and T20I squads. \n Aamir Jamal, Abdullah Shafique, Abrar Ahmed, Faisal Akram, Kamran Ghulam, Mohammad Rizwan, Saim Ayub and Shahnawaz Dahani, who have been picked in the ODI side, will be replaced by Arafat Minhas, Jahandad Khan, Mohammad Abbas Afridi, Omair Bin Yousuf, Qasim Akram, Sahibzada Farhan, Mohammad Abbas Afridi and Usman Khan for the T20I series in Australia. \n \n \n \n: Aamir Jamal, Abdullah Shafique, Arafat Minhas, Babar Azam, Faisal Akram, Haris Rauf, Haseebullah (WK), Kamran Ghulam, Mohammad Hasnain, Mohammad Rizwan (WK), Muhammad Irfan Khan, Naseem Shah, Saim Ayub, Agha Salman, Shaheen Shah Afridi \n \n: Arafat Minhas, Babar Azam, Haris Rauf, Haseebullah, Jahandad Khan, Mohammad Abbas Afridi, Mohammad Rizwan (WK), Muhammad Irfan Khan, Naseem Shah, Omair Bin Yousuf, Sahibzada Farhan, Agha Salman, Shaheen Shah Afridi, Sufyan Moqim, Usman Khan \n \n \n \n: Aamir Jamal, Abdullah Shafique, Abrar Ahmed, Ahmed Daniyal, Faisal Akram, Haris Rauf, Haseebullah (WK), Kamran Ghulam, Mohammad Hasnain, Mohammad Rizwan (WK), Muhammad Irfan Khan, Saim Ayub, Agha Salman, Shahnawaz Dahani and Tayyab Tahir \n \n: Ahmed Daniyal, Arafat Minhas, Haris Rauf, Haseebullah (WK), Jahandad Khan, Mohammad Abbas Afridi, Mohammad Hasnain, Muhammad Irfan Khan, Omair bin Yousuf, Qasim Akram, Sahibzada Farhan, Agha Salman, Sufyan Moqim, Tayyab Tahir and Usman Khan \n Babar, Faisal Akram, Rauf, Hasnain, Irfan Khan, Naseem, and Shaheen will depart for Melbourne on October 28, with the remaining ODI players leaving on October 29. Gary Kirsten, Pakistan's white-ball coach, will join the squad in Melbourne on October 28. "
        },
        {
            "title": "Shan Masood relishes Pakistan's 'adaptability' and 'sacrifices' of his batters",
            "news": " Though the series was going to be played in Pakistan, the hosts were never favourites to win it. Pakistan had hit rock-bottom and following the first-ever series defeat to Bangladesh, that also at home, just one month back, there was little to be optimistic about. \n But, Pakistan cricket is at its best when there is chaos, and there was plenty of it following a defeat in the first Multan Test. It resulted in one of the most epic comeback series wins for Pakistan as the second Multan Test brought a 152-run victory and the Rawalpindi Test finished within two days and one session with Pakistan's commanding nine-wicket win. \n Pakistan ripped apart their previous supposed blueprint of success - which revolved around seam-friendly conditions - to produce rank turners to give themselves a shot at picking 20 England wickets. After conceding 823 for seven on a dead deck in the first Test, Pakistan bowled out England four times for 814 runs in the next two Tests. The spinners took all of these 40 wickets with Sajid Khan, the player of the series, and Noman Ali doing the heavy lifting, taking 19 and 20 wickets each. \n Sajid and Noman broke several records in Pakistan's historic Test series win - their first since they defeated South Africa in February 2021. The most recent saw Sajid become the first spinner to take 10 wickets in a match at Rawalpindi. \n The new template, however, has brought struggles for Pakistan batters too. Things might have been different had Saud Shakeel not rescued his side with a gritty 134 yesterday after Pakistan slipped to 177 for 7 with a trail of 90 to surmount. \n Shan Masood reminded about the sacrifices that his batters have had to make so Sajid and Noman could do what they did. \"This is a team game and we should appreciate the fact that our batting unit has made a sacrifice for the bowlers to take 20 wickets,\" he said when he was put on spot by a journalist about his form and the inconsistent runs of openers Saim Ayub and Abdullah Shafique. \"We played Bangladesh on seam-friendly pitches and England in these conditions so we can take 20 wickets. In such conditions, the responsibility of the batting unit is to set matches for the bowlers and it may result in low scores. Yesterday, Rizwan and I played uncharacteristic innings as we batted for 50 and 70 balls, respectively, but those 120 balls made the job easier for Saud, Sajid, and Noman. So this is a team game.\" \n After scoring what was his fourth century in Tests, Shakeel told the host broadcasters at the close of play that it was easier to score runs against the spinners when the ball lost its hardness as compared to earlier in the innings. England and Pakistan had played three frontline spinners in the third Test. While Pakistan bowled all their overs with spin, England called on Gus Atkinson for only 12 of the 100 overs they bowled. \n Pakistan's decision to open with the young pair of Saim and Abdullah is yet to bear fruit. The pair has opened for Pakistan in all six Tests they have played this year and averages only eight in 12 innings. Their 35-run stand in the first innings of this Test was the best. \n \"Day before yesterday, the 35-run partnership between Abdullah and Saim was beneficial for the team,\" Shan continued. \"We always look at individual performances from the perspective of how they have helped the team. It is very easy to say that someone has not performed or have not led from the front, but we should rather look at what he has done for the team. We got characters in the last two games who have contributed for the team in the field, with the bat, and with the ball. \n \"Saim and Abdullah are the future of Pakistan cricket. The openers have had lesser returns since the beginning of the World Test Championship - it is a fact. So unless we develop our players, we will continue to chop and change. Pakistan team needs stability at the moment. But when we think that changes are necessary to put the team on a winning track, we will make them, as we did after the first Test.\" \n Masood praised his side for adapting to the new template that the new members of the selection committee - Aaqib Javed, Aleem Dar, and Azhar Ali - had enforced upon the side. The Pakistan captain had said in a media conference in Karachi - before departing for Multan in the lead up to this series - that Pakistan felt more at home by emulating Australia like seam-conducive surfaces after the experiment of green surfaces had backfired against Bangladesh. \n Cricbuzz had revealed after the second Test that the Pakistan Cricket Board chairperson empowered the new selection committee to take all the cricket-related calls during the series and Pakistan red ball head coach Jason Gillespie revealed that he was \"\n\" on the eve of the third Test. That revelation only further established that this new template had been thrusted upon the team management that had a different method for success in mind. \n \"We should appreciate the fact that despite playing in these conditions for the first time at home, we responded better than the opposition,\" he said. \"We have to develop an all-round team that can produce result in any condition...You will need to adapt to conditions around the world to be a top Test side. There are three series each home and away in the world Test championship. \n \"So you will have to score runs and take 20 wickets in different conditions. I don't think we have a ground in Pakistan where such conditions were produced before [in domestic cricket]. There are grounds in Karachi and the main stadium in Faisalabad where we get conditions close to what we got here in Rawalpindi. But, it is important that we identify characteristics of each our venues and play certain oppositions at certain venues and prepare accordingly.\" \n These last two Tests were also the first wins for Masood as the captain. So, how does the captain feel finally winning a Test series. \"It was never about my name being at the door,\" he said. \"It is about the responsibility that comes with wearing this star. I had used the word \"hurt\" as we had lost six Tests on trot since I had taken over. I feel we did not build on some good things that we did in Australia. At the end of the day, Pakistan cricket needs to progress and that should be our aim whether it is the media, cricketers, the cricket board or the fans. Obviously, that was not happening and it was painful. \n \"But considering how the management, selectors, and the team has responded amidst all the chaos, it reflects their character. We all should be a little sympathetic towards each other in tough times and try to find solutions. \n \"Being a captain is a responsibility and this bigger responsibility comprises many smaller responsibilities. You have to make the right calls when it comes to selection and do justice in everything that you do. It always hurts when our country loses whether as a player or captain and that is why I was hurting. Captaining your country is a great honour and I don't think anyone can get any honour bigger than this.\" \n Pakistan's next Test assignment is a two-Test series in South Africa that begins with the Boxing Day Test at Centurion. That tour will bring a different set of challenges - perhaps, more stern for the Pakistan batters. \n They last travelled to the country for Tests in 2019 and were walloped 3-0. Before that Pakistan go to Australia to play three ODIs and as many T20Is and Masood hopes that playing the Australian pacers in white ball cricket can be a good preparation. \n \"The Australia series can give the guys some good challenges into bouncier conditions in South Africa. The side that Australia have named are a lot of the batters from the Test side, too. We have been to SA in 2019 where a lot of these current players for Pakistan have been there. The challenge is completely different, but for us it is about making sure we pick 20 wickets and back it up with the bat by scoring the required runs.\" \n Masood has been harping on the necessity of taking 20 wickets since the start of this series. The call stays the same. "
        },
        {
            "title": "WTC scenarios: India cede sure footing; Resurgent NZ make their way up",
            "news": " New Zealand's \n in the second Test in Pune - one that clinched them a historic first series win in India - has further intensified the race to a top-two finish in the ongoing World Test Championship 2023-25 cycle. While India continue to hold on to their top position in the table - only marginally ahead of Australia - and have their fate in their own hands, New Zealand's back-to-back wins and South Africa's seven-wicket win over Bangladesh earlier this week has put five teams in contention with a genuine shot at making the final. \n Meanwhile, Pakistan's come-from-behind 2-1 series win against England has even given them an outside chance of featuring in the showpiece final at Lord's. West Indies, England and Bangladesh have been eliminated from the race. \n \n \n \n \n \n1 Test vs NZ (H); 5 Tests vs Aus (A) \n For India to confirm a spot in the final without relying on other results, the equation is simple: win at least four of the remaining six Tests - ideally, including the next one in Mumbai - and attain a PCT of 64.03%, which can only be bettered by South Africa or Sri Lanka at this stage. They can still make it if they win the Mumbai Test, and win the five-match Border-Gavaskar series by any margin (even 1-0, provided the South Africa vs Sri Lanka series later in the season doesn't end in a 1-1 draw). Draws however, have been highly rare in recent times: just three of the 49 Tests in the ongoing WTC cycle have ended in draws, each featuring a rain-interruption. \n If India go an even 3-3 in the remainder of the cycle, they'll finish at 58.77%, and that can be surpassed by each of Australia, Sri Lanka, South Africa and New Zealand, thereby leaving them precariously placed. \n \n \n \n 1 Test vs Ind (A); 3 Tests vs Eng (H) \n New Zealand's emphatic comeback following defeat in Sri Lanka has helped them surpass South Africa in the standings, and a spotless 4-0 run in their remaining four matches will take them to 64.29%. That however, won't be enough as it can be bettered by two of the other four teams in contention. For New Zealand to finish in the top-two in this scenario, if the South Africa vs Sri Lanka series ends in a cleansweep (either way) they'd want the winner to drop at least one of their other remaining matches to go through, alongside India or Australia. Three wins will take them to 57.14%, still offering an outside chance if several other results go their way. \n \n \n \n1 Test vs Ban (A); 2 Tests vs SL (H); 2 Tests vs Pak (H) \n South Africa are currently at the fifth positionin the standings with a PCT of 47.61%. If they win each of their remaining five Tests, they'll finish at 69.44%, which will confirm them a top-two finish. Four wins out of five will take them to 61.11%, still putting them in with a solid chance, depending on other results featuring India, Australia and Sri Lanka. \n \n \n \n 2 Tests vs SA (A); 2 Tests vs Aus (H) \n Sri Lanka's late revival - three wins in last three Tests - has put them in with a great chance, and an extension of that winning streak to seven will take them to 69.23%, which can only be surpassed by one of India and Australia. Three wins will take them to 61.53%, and in this case, they'd just want New Zealand to drop at least one of their remaining four games to render the Border-Gavaskar series result immaterial. If the South Africa vs Sri Lanka series ends in a 1-1 draw, and both teams win their remaining games, Sri Lanka would still pip the Proteas marginally on PCT (61.53% vs 61.11%). \n \n \n \n 5 Tests vs Ind (H); 2 Tests vs SL (A) \n Australia, who have been out of action in Tests since their 2-0 cleansweep of New Zealand in February-March, will face top-placed India (5 Tests) and the third-placed Sri Lanka (2 Tests) in the remainder of the cycle. Five wins out of seven will take them to 65.79%, which will be enough for them to secure a final berth. Four wins will take them to 60.52%, and leave them delicately placed as that can be bettered by two of India, Sri Lanka and South Africa. Anything less will have them relying further on other results. \n \n \n \n 2 Tests vs SA (A); 2 Tests vs WI (H) \n Pakistan scripted an epic turnaround to beat England 2-1 at home, but it could be too little too late for them given their dismal start to the cycle. Four wins will help them finish at 52.38, and that could only be enough if several other results go their way, including a few draws to deprive multiple teams in contention of points. \n \n "
        },
        {
            "title": "BCCI amends rule regarding penalty runs in domestic cricket",
            "news": " The Board of Control for Cricket in India (BCCI) has made a slight amendment to the rule on penalty runs in domestic cricket. In a clarification note sent to the state associations recently, the BCCI declared that if the ball accidentally comes in contact with any equipment or object while in play, it will not be considered illegal fielding. \n \"It is not considered illegal fielding if the ball contacts piece of clothing, equipment or any other object that has accidentally fallen from the fielder's person. Wicketkeeping gloves or a fielde'r cap that is tucked into the fielder's waistband, will not be penalised with penalty runs. The ball will remain in play and a dismissal would be valid,\" the exact note, seen by Cricbuzz, reads. \n The clarification is in stark contrast with previous notes, which had prescribed a five-run penalty in such instances. Here goes the relevant question and answer on the topic between the BCCI and an umpire. \n \n \n \n \n \n \n There are many instances of a bowler keeping a piece of clothing tucked in his waistband. If this clothing accidentally falls and the ball makes contact with it, a penalty of five runs would be imposed and the ball would be declared dead. Moreover, if a cap accidentally fell from the waist and came into contact with the ball, it was traditionally ruled invalid. \n To be specific, KL Rahul would be seen placing his cap on the front side of his waist, with half of it tucked inside and the other half hanging out. Normally, wicketkeepers would tuck it in at the back. There were no known instances of the cap falling, but a risk was always there. In such a situation, it would have previously resulted in a penalty. However, under the new rules, this will no longer be considered illegal. \n \n \n If a fielder illegally fields the ball, the ball shall immediately become dead and \n - the penalty for a No ball or a Wide shall stand. \n - any runs completed by the batters shall be credited to the batting side, together with the run in progress if the batters had already crossed at the instant of the offence. \n - the ball shall not count as one of the over. \n In addition the umpire shall: \n - award 5 Penalty runs to the batting side. \n - inform the other umpire and the captain of the fielding side of the reason for this action. \n - inform the batters and, as soon as practicable, the captain of the batting side of what has occurred. \n - The umpires together may report the occurrence as soon as possible after the match to the BCCI Match Referee. \n \n "
        },
        {
            "title": "Nayeem expects Chattogram to aid Bangladesh's fightback plans",
            "news": " Bangladesh off-spinner Nayeem Hasan feels that the conditions in Chattogram would suit Bangladesh a lot more than they did in Dhaka as the hosts gear up for the second Test against South Africa. Currently trailing the series 0-1, Nayeem opined that general nature of the pitches in Chattogram could especially help Bangladesh's batters after their forgettable performance in the opening Test. The two teams arrived in the port city on Saturday (October 26) and completed their first practice session at the ZACS on Sunday (October 27). \n \"I haven't seen the wicket yet, but if it's spin-friendly, there will be spin. Our pitch here usually offers slower spin, which is good for us,\" Nayeem said on Sunday. \n \"Here, players like Mominul bhai and Mushy(Mushfiqur) bhai play spin very well. Compared to the skiddy pitches there (in Mirpur) the slow nature here suits us as it is easier to adapt (from batting point of view),\" he said. \n \"The slow nature can also help our spin unit because they can bowl faster, above 90,\" he said \n Bangladesh lost their opening Test to South Africa by seven wickets largely due to the failure of their batting unit that has remained inconsistent for quite some time but according to Nayeem, who is eyeing for a spot to play in front of his home crowd, it will be easier in ZACS as the ball spins slower compared to ZACS where the ball skids and make it difficult to adapt. \n \"I think the wicket here will be different from Mirpur and our spinners are, by the grace of Allah, in great shape-Taijul bhai, Miraz bhai-and Inshallah, we'll achieve a good result,\" he said. \n Nayeem added that he will try to give Bangladesh the much-needed win in the second and final Test against South Africa on his home ground, if he is selected in the playing XI. \n Chattogram's Nayeem picked up six wickets the last time he played at ZACS, against Sri Lanka in 2022 but his place in the playing XI is yet not certain as Bangladesh, who played with one pacer in the opening game, might add another quick in their playing XI, as the grass on the surface suggests that there might be some pace and carry for the faster bowlers. \n \"In sha Allah, I believe we'll achieve a good result here. We'll try to level the series,\" said the off-spinner after his training session. \n \"Alhamdulillah, the last time I played on this ground, I took six wickets. But now I'm working on my preparation, aiming to give my best. I'm focusing on what's necessary for the match and working on avoiding the mistakes from the last game,\" he said. \n \"We are all hopeful. We'll play to win, Inshallah. At the end of the day, our goal is to stick to the process. Thinking about the result now would only distract us from maintaining the process,\" he said. \n \"We don't want to miss this opportunity. I'll try my best to help win the match if I'm in the XI. I'll try to be the one who brings victory for the team. If each of us believes, 'I'll win the match,' then whoever clicks will bring the win, Inshallah. I'll try to secure victory on my home ground,\" he concluded. "
        }
    ],
    "match_details": [
        {
            "title": "Nepal v Scotland, 39th Match - Upcoming",
            "summary": {
                "Series": "ICC Cricket World Cup League Two 2023-27",
                "Venue": "Prairie View Cricket Complex, Houston",
                "Date & Time": "Oct 29, 11:30 AM LOCAL",
                "Mini Score Bowling": null,
                "Mini Score Batting": null,
                "Match Status": "Match is not started yet.",
                "Player of the Match": null,
                "Player of the Series": null
            }
        },
        {
            "title": "United States of America v Scotland, 37th Match - SCO Won",
            "summary": {
                "Series": "ICC Cricket World Cup League Two 2023-27",
                "Venue": "Prairie View Cricket Complex, Houston",
                "Date & Time": "Oct 25, 10:30 AM LOCAL",
                "Mini Score Bowling": "USA 144 (38.4)",
                "Mini Score Batting": "SCO 145/0 (24.5)",
                "Match Status": "Scotland won by 10 wkts",
                "Player of the Match": "Bradley Currie",
                "Player of the Series": "Series is not completed yet."
            }
        },
        {
            "title": "Uganda v Bahrain, 2nd T20I - Upcoming",
            "summary": {
                "Series": "Bahrain in Uganda 2024",
                "Venue": "Jinja Cricket Ground, Jinja",
                "Date & Time": "Oct 29, 10:00 AM LOCAL",
                "Mini Score Bowling": null,
                "Mini Score Batting": null,
                "Match Status": "Match is not started yet.",
                "Player of the Match": null,
                "Player of the Series": null
            }
        },
        {
            "title": "Nepal v United States of America, 38th Match - Live",
            "summary": {
                "Series": "ICC Cricket World Cup League Two 2023-27",
                "Venue": "Prairie View Cricket Complex, Houston",
                "Date & Time": "Oct 27, 10:30 AM LOCAL",
                "Mini Score Bowling": null,
                "Mini Score Batting": null,
                "Match Status": "Match is not started yet.",
                "Player of the Match": null,
                "Player of the Series": null
            }
        },
        {
            "title": "New Zealand v India, 2nd Test - NZ Won",
            "summary": {
                "Series": "New Zealand tour of India, 2024",
                "Venue": "Maharashtra Cricket Association Stadium, Pune",
                "Date & Time": "Oct 24 - Oct 26 09:30 AM LOCAL",
                "Mini Score Bowling": "NZ 259 & 255",
                "Mini Score Batting": "IND 156 & 245",
                "Match Status": "New Zealand won by 113 runs",
                "Player of the Match": "Mitchell Santner",
                "Player of the Series": "Series is not completed yet."
            }
        },
        {
            "title": "Sri Lanka v West Indies, 3rd ODI - WI Won",
            "summary": {
                "Series": "West Indies tour of Sri Lanka, 2024",
                "Venue": "Pallekele International Cricket Stadium, Pallekele",
                "Date & Time": "Oct 26, 02:30 PM LOCAL",
                "Mini Score Bowling": "SL 156/3 (23)",
                "Mini Score Batting": "WI 196/2 (22)",
                "Match Status": "West Indies won by 8 wkts (Match reduced to 23 overs due to rain, DLS target 195)",
                "Player of the Match": "Evin Lewis",
                "Player of the Series": "Charith Asalanka"
            }
        },
        {
            "title": "England v Pakistan, 3rd Test - PAK Won",
            "summary": {
                "Series": "England tour of Pakistan, 2024",
                "Venue": "Rawalpindi Cricket Stadium, Rawalpindi",
                "Date & Time": "Oct 24 - Oct 26 10:00 AM LOCAL",
                "Mini Score Bowling": "ENG 267 & 112",
                "Mini Score Batting": "PAK 344 & 37/1",
                "Match Status": "Pakistan won by 9 wkts",
                "Player of the Match": "Saud Shakeel",
                "Player of the Series": "Sajid Khan"
            }
        },
        {
            "title": "Bangladesh v South Africa, 2nd Test - Upcoming",
            "summary": {
                "Series": "South Africa tour of Bangladesh, 2024",
                "Venue": "Zahur Ahmed Chowdhury Stadium, Chattogram",
                "Date & Time": "Oct 29 - Nov 02 09:30 AM LOCAL",
                "Mini Score Bowling": null,
                "Mini Score Batting": null,
                "Match Status": "Match is not started yet.",
                "Player of the Match": null,
                "Player of the Series": null
            }
        },
        {
            "title": "Uganda v Bahrain, 1st T20I - Upcoming",
            "summary": {
                "Series": "Bahrain in Uganda 2024",
                "Venue": "Jinja Cricket Ground, Jinja",
                "Date & Time": "Oct 28, 10:00 AM LOCAL",
                "Mini Score Bowling": null,
                "Mini Score Batting": null,
                "Match Status": "Match is not started yet.",
                "Player of the Match": null,
                "Player of the Series": null
            }
        }
    ]
}