{
    "latest_news_section": [
        {
            "Nayeem expects Chattogram to aid Bangladesh's fightback plans": "Bangladesh off-spinner Nayeem Hasan believes the conditions in Chattogram will favor the hosts in the second Test against South Africa. With the series 0-1 in their favor, Nayeem thinks Chattogram's slower pitches will help their batters, particularly Mominul and Mushfiqur, who play spin well. He aims to give Bangladesh a good result and contribute to the team in the final Test."
        },
        {
            "BCCI amends rule regarding penalty runs in domestic cricket": "The Board of Control for Cricket in India (BCCI) has relaxed the rules on penalty runs in domestic cricket. Now, if the ball accidentally hits a fielder's equipment or object, it won't be considered illegal fielding, but rather the ball will remain in play. This change reverses previous rules which imposed five-run penalties for such incidents. BCCI sent a clarification note to state associations detailing this new amendment."
        },
        {
            "USA Cricket sacks head coach Stuart Law following allegations": "US coach Stuart Law was sacked with immediate effect after a 10-wicket defeat to Scotland, amidst allegations of discrimination, mistrust, and favoritism. Law, 56, had a successful past as a coach in Sri Lanka, West Indies, and Bangladesh, but tensions rose with USA players, including captain Monank Patel, during the Netherlands tour. Vincent Vinay Kumar will take over as interim head coach, aided by Usman Rafiq."
        },
        {
            "Shan Masood relishes Pakistan's 'adaptability' and 'sacrifices' of his batters": "Pakistan cricket delivered a historic comeback series win over England, their first since defeating South Africa in February 2021. Pakistan spinners Sajid Khan and Noman Ali dominated, taking 19 and 20 wickets each. The team adapted to new conditions with a focus on spin-friendly pitches, sacrificing batting scores to achieve this win."
        },
        {
            "England weren't able to stand up to Pakistan's challenges: Ben Stokes": "England cricket captain Ben Stokes admitted they couldn't respond to Pakistan's challenges in the last two Tests. Pakistan staged an epic comeback to win the series 2-1, with England struggling on rank turners. Stokes praised Pakistan's efforts, particularly Sajid Khan's crucial innings. England has a quick turnaround to three Tests in New Zealand and must put the disappointment behind them, with Stokes confident in his team's batting despite low scores."
        },
        {
            "CSK look ahead as Dhoni clears the air over IPL participation": "MS Dhoni has assured Chennai Super Kings (CSK) of his participation in the upcoming IPL season. CSK CEO Kasi Viswanathan confirmed that Dhoni will play when he's ready. Dhoni expressed his desire to enjoy his cricket in the remaining years of his career, with the goal of playing for nine months to be fit for the two-and-a-half-month IPL. Retention decisions will be finalised soon."
        },
        {
            "WTC scenarios: India cede sure footing; Resurgent NZ make their way up": "The cricket match in India has intensified the WTC 2023-25 cycle with five teams in contention for the final. India, with a top position, must win at least four out of six remaining Tests to confirm a spot without relying on others. New Zealand's comeback is strengthening, South Africa's revival could secure a top-two spot, while Sri Lanka and Australia also have chances, provided they secure victories and team performances allow them."
        },
        {
            "'We wanted to fire a shot first up and I certainly think we've done that in both games'": "New Zealand captain Tom Latham hailed his team's historic series win in India, his first as a captain in the country. Latham praised bowler Mitchell Santner, who took 13 wickets, and his team's consistency in playing attacking cricket. Credit was also given to the preparation done before the series, particularly after a Sri Lankan tour, where they struggled, helping to improve their response to Indian conditions."
        },
        {
            "Pakistan name Rizwan as white-ball captain, pick six uncapped players for AUS, ZIM tours": "Pakistan have named Mohammad Rizwan as the permanent white-ball captain, succeeding Babar Azam. Rizwan's first assignments will be the tours of Australia and Zimbabwe, where he'll lead a team including six uncapped players. The team will play three ODIs and three T20Is in each country, with squad changes for the T20I series in Australia and Zimbabwe's white-ball rubber, starting November 4 and 24 respectively."
        },
        {
            "Need to find ways of scoring runs to put bowlers under pressure: Rohit Sharma": "India suffered their first Test series loss at home in 12 years, losing to New Zealand by 113 runs in Pune. Rohit Sharma blamed the team's poor batting, citing a need to adapt to spin on tricky surfaces. He wants batters to explore various scoring options, including paddle and reverse sweeps, to counter spinners. Rohit defended his spinners, Ashwin and Jadeja, saying they have high expectations and not one series can define their careers."
        }
    ],
    "match_details": [
        {
            "Uganda v Bahrain, 1st T20I - Upcoming": "\"The 1st T20I between Uganda and Bahrain at Jinja Cricket Ground, Jinja on Oct 28, 10:00 AM LOCAL. Match status: yet to commence.\""
        },
        {
            "Uganda v Bahrain, 2nd T20I - Upcoming": "Bahrain vs Uganda, Jinja Cricket Ground, Oct 29, 10:00 AM LOCAL. The match is yet to start for the Bahrain in Uganda 2024 series."
        },
        {
            "Nepal v United States of America, 38th Match - Ings Break": "\"ICC World Cup League Two 2023-27: Opening match of the series underway at Prairie View Cricket Complex in Houston with a local start at 10:30 AM on Oct 27, awaiting start highlights.\""
        },
        {
            "Nepal v Scotland, 39th Match - Upcoming": "The ICC Cricket World Cup League Two 2023-27 match between two teams at Prairie View Cricket Complex, Houston, is scheduled to start on October 29 at 11:30 AM LOCAL."
        },
        {
            "Sri Lanka v West Indies, 3rd ODI - WI Won": "\"West Indies beat Sri Lanka by 8 wickets at Pallekele on Oct 26, 2024, (DLS target: 195, Match reduced to 23 overs due to rain). Evin Lewis was the key to the win.\""
        },
        {
            "England v Pakistan, 3rd Test - PAK Won": "England tour of Pakistan, 2024: Pakistan comprehends victory, losing just 1 wicket, at Rawalpindi Cricket Stadium after surpassing England with consecutive scores, 344 and 37/1."
        },
        {
            "New Zealand v India, 2nd Test - NZ Won": "India (245 & 156) vs New Zealand (259 & 255) at Maharashtra Cricket Association Stadium, Pune. NZ won by 113 runs with Mitchell Santner being the Player of the Match."
        },
        {
            "Bangladesh v South Africa, 2nd Test - Upcoming": "\"Bangladesh vs South Africa, 1st Test: Starting at Zahur Ahmed Chowdhury Stadium, Chattogram, from Oct 29 - Nov 02, 9:30 AM LOCAL, the series will mark a new chapter in South Africa's tour of Bangladesh.\""
        },
        {
            "United States of America v Scotland, 37th Match - SCO Won": "Scotland wins ICC Cricket World Cup League Two 2023-27 match against USA by 10 wickets at Prairie View Cricket Complex, Houston on Oct 25, led by Bradley Currie's performance."
        }
    ]
}